In [26]:
import pandas

Zadání 1

Načtení dat a zobrazení infa o nich.

In [3]:
zam_liberec = pandas.read_csv("zam_liberec.csv")
zam_plzen = pandas.read_csv("zam_plzen.csv")
zam_praha = pandas.read_csv("zam_praha.csv")

In [5]:
print('Dataframe zaměstnanci Liberec')
display(zam_liberec.head())
display(zam_liberec.info())

print('Dataframe zaměstnanci Plzeň')
display(zam_plzen.head())
display(zam_plzen.info())

print('Dataframe zaměstnanci Praha')
display(zam_praha.head())
display(zam_praha.info())

Dataframe zaměstnanci Liberec

       jmeno    prijimeni   telefonni_cislo  cislo_zamestnance
0       Nela      Šťastná       728 454 176                 83
1    Heather      Marková       604 404 522                 84
2     Krista  Procházková  +421 50 444 5544                 85
3   Jennifer        Brown       775 545 190                 86
4  Ladislava    Blackwell  +421 913 487 200                 87

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              11 non-null     object
 1   prijimeni          11 non-null     object
 2   telefonni_cislo    11 non-null     object
 3   cislo_zamestnance  11 non-null     int64
dtypes: int64(1), object(3)
memory usage: 484.0+ bytes

None

Dataframe zaměstnanci Plzeň

      jmeno    prijimeni   telefonni_cislo  cislo_zamestnance
0     Stacy  Pospíšilová       727 293 880                  3
1     Matěj         Král       770 787 377                  6
2    Amanda       Wilson  +421 52 656 7231                  7
3     Angel       Wilson  +421 52 135 2491                  8
4  Jindřich       Howell  +421 39 043 0948                 10

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              16 non-null     object
 1   prijimeni          16 non-null     object
 2   telefonni_cislo    16 non-null     object
 3   cislo_zamestnance  16 non-null     int64
dtypes: int64(1), object(3)
memory usage: 644.0+ bytes

None

Dataframe zaměstnanci Praha

      jmeno prijimeni   telefonni_cislo  cislo_zamestnance
0     Brian      Hall  +421 949 656 098                 30
1     Marta  Kolářová       730 456 163                 32
2      John   Moravec       725 092 179                 33
3  Dominika   Kopecká       722 747 626                 34
4    Marcel     Hájek  +421 902 928 669                 35

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              29 non-null     object
 1   prijimeni          29 non-null     object
 2   telefonni_cislo    29 non-null     object
 3   cislo_zamestnance  29 non-null     int64
dtypes: int64(1), object(3)
memory usage: 1.0+ KB

None

Ke každé tabulce přidej nový sloupec mesto, které bude obsahovat informaci o tom, ve kterém městě zaměstnanec pracuje.

In [7]:
zam_praha['mesto'] = 'Praha'
zam_plzen['mesto'] = 'Plzeň'
zam_liberec['mesto'] = 'Liberec'

Vytvoř novou tabulku zamestnanci a ulož do ní informace o všech zaměstnancích (operace concat).

In [11]:
zamestnanci = pandas.concat([zam_praha, zam_plzen, zam_liberec])
print('Dataframe všichni zaměstnanci')
display(zamestnanci.head())
display(zamestnanci.info())

Dataframe všichni zaměstnanci

      jmeno prijimeni   telefonni_cislo  cislo_zamestnance  mesto
0     Brian      Hall  +421 949 656 098                 30  Praha
1     Marta  Kolářová       730 456 163                 32  Praha
2      John   Moravec       725 092 179                 33  Praha
3  Dominika   Kopecká       722 747 626                 34  Praha
4    Marcel     Hájek  +421 902 928 669                 35  Praha

<class 'pandas.core.frame.DataFrame'>
Index: 56 entries, 0 to 10
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              56 non-null     object
 1   prijimeni          56 non-null     object
 2   telefonni_cislo    56 non-null     object
 3   cislo_zamestnance  56 non-null     int64
 4   mesto              56 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.6+ KB

None

Ze souboru platy_2021_02.csv načti platy zaměstnanců za únor 2021. Propoj tabulku (operace join) s platy a tabulku se zaměstnanci pomocí sloupce cislo_zamestnance.

In [14]:
platy = pandas.read_csv("platy_2021_02.csv")
print('Dataframe s platy')
display(platy.head())
display(platy.info())

Dataframe s platy

   cislo_zamestnance     plat
0                  3  54900.0
1                  6  54800.0
2                  7  36400.0
3                  8  47900.0
4                 16  34200.0

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43 entries, 0 to 42
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   cislo_zamestnance  43 non-null     int64
 1   plat               43 non-null     float64
dtypes: float64(1), int64(1)
memory usage: 820.0 bytes

None

In [16]:
zamestnanci_platy = pandas.merge(zamestnanci, platy, on='cislo_zamestnance', how='left')
print('Spojený dataframe s platy a zaměstnanci')
display(zamestnanci_platy.head())
display(zamestnanci_platy.info())

Spojený dataframe s platy a zaměstnanci

      jmeno prijimeni   telefonni_cislo  cislo_zamestnance  mesto     plat
0     Brian      Hall  +421 949 656 098                 30  Praha  33500.0
1     Marta  Kolářová       730 456 163                 32  Praha  53000.0
2      John   Moravec       725 092 179                 33  Praha  38400.0
3  Dominika   Kopecká       722 747 626                 34  Praha  36800.0
4    Marcel     Hájek  +421 902 928 669                 35  Praha      NaN

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56 entries, 0 to 55
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              56 non-null     object
 1   prijimeni          56 non-null     object
 2   telefonni_cislo    56 non-null     object
 3   cislo_zamestnance  56 non-null     int64
 4   mesto              56 non-null     object
 5   plat               43 non-null     float64
dtypes: float64(1), int64(1), object(4)
memory usage: 2.8+ KB

None

Porovnej rozměry tabulek před spojením a po spojení. Pokud nemá některý zaměstnanec plat za únor, znamená to, že v naší firmě již nepracuje.

In [20]:
pocet_jiz_nepracujicich = len(zamestnanci) - len(platy)
print(f"Ve firmě v únoru nepracovalo {pocet_jiz_nepracujicich} zaměstnanců z původního seznamu.")

Ve firmě v únoru nepracovalo 13 zaměstnanců z původního seznamu.

Spočti průměrný plat zaměstnanců v jednotlivých kancelářích.

In [25]:
print('Průměrné platy v jednotlivých kancelářích:')
platy_kancelare = round(zamestnanci_platy.groupby('mesto')['plat'].mean(), 2)
platy_kancelare

Průměrné platy v jednotlivých kancelářích:

mesto
Liberec    43775.00
Plzeň      44792.86
Praha      43295.24
Name: plat, dtype: float64

Zadání 2

Načtení dat s výkazy a info o nich:

In [27]:
vykazy = pandas.read_csv("vykazy.csv")
print('Dataframe s výkazy')
display(vykazy.head())
display(vykazy.info())

Dataframe s výkazy

         date  hours project  emloyee_id
0  2021-02-01    2.5     F30          13
1  2021-02-01    3.4     W05          70
2  2021-02-01    2.1     JL9          72
3  2021-02-01    5.2     F30           3
4  2021-02-01    2.4     TE1          54

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27 entries, 0 to 26
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        27 non-null     object
 1   hours       27 non-null     float64
 2   project     27 non-null     object
 3   emloyee_id  27 non-null     int64
dtypes: float64(1), int64(1), object(2)
memory usage: 996.0+ bytes

None

Proveď agregaci a zjisti celkový počet vykázaných hodin za jednotlivé projekty.

In [33]:
print('Počet hodin za jednotlivé projekty:')
hodiny_projekty = vykazy.groupby('project')['hours'].sum()
hodiny_projekty

Počet hodin za jednotlivé projekty:

project
F30    21.5
JL9     2.1
TE1    16.0
W05    30.5
YLI    31.0
Name: hours, dtype: float64

Nepovinný bonus 1

Ulož do proměnné počet zaměstnanců, kteří v naší firmě již nepracují.

In [35]:
print("Již uloženo v proměnné pocet_jiz_nepracujicich.")
pocet_jiz_nepracujicich

Již uloženo v proměnné pocet_jiz_nepracujicich.

13

V rámci úspory se IT oddělení rozhodlo prověřit licence přidělené zaměstnancům, kteří ve firmě již nepracují. Vytvoř samostatnou tabulku, která obsahuje jména zaměstnanců, kteří ve firmě již nepracují. Tabulku ulož do souboru CSV.

In [39]:
nepracujici = zamestnanci_platy[zamestnanci_platy['plat'].isnull()]
nepracujici = nepracujici[['jmeno', 'prijimeni']].to_csv('nepracujici_zamestnanci.csv', index=False, sep=' ')

Nepovinný bonus 2

Propoj tabulku s výkazy s tabulkou se zaměstnanci, kterou jsi vytvořil(a) v předchozím cvičení.

In [54]:
vykazy = vykazy.rename(columns={'date': 'datum', 'hours': 'pocet_hodin', 'project': 'projekt', 'emloyee_id': 'cislo_zamestnance'})
zamestnanci_s_vykazy = pandas.merge(vykazy, zamestnanci_platy, on='cislo_zamestnance', how='outer')
print('Dataframe se zaměstnanci i výkazy')
display(zamestnanci_s_vykazy.head())
display(zamestnanci_s_vykazy.info())

Dataframe se zaměstnanci i výkazy

,datum,pocet_hodin,projekt,cislo_zamestnance,jmeno,prijimeni,telefonni_cislo,mesto,plat
0,2021-02-01,2.5,F30,13,Alexander,Martinez,721 195 689,Plzeň,NaN
1,2021-02-01,3.4,W05,70,Dillon,Black,734 300 978,Praha,52600.0
2,2021-02-01,2.1,JL9,72,Robert,Říha,727 351 984,Praha,NaN
3,2021-02-01,5.2,F30,3,Stacy,Pospíšilová,727 293 880,Plzeň,54900.0
4,2021-02-01,2.4,TE1,54,Michelle,Vlčková,+421 41 720 7806,Praha,NaN

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62 entries, 0 to 61
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   datum              27 non-null     object
 1   pocet_hodin        27 non-null     float64
 2   projekt            27 non-null     object
 3   cislo_zamestnance  62 non-null     int64
 4   jmeno              62 non-null     object
 5   prijimeni          62 non-null     object
 6   telefonni_cislo    62 non-null     object
 7   mesto              62 non-null     object
 8   plat               46 non-null     float64
dtypes: float64(2), int64(1), object(6)
memory usage: 4.5+ KB

None

Následně proveď statistiku vykázaných hodin za jednotlivé kanceláře, tj. spočítej celkový počet hodin vykázaný zaměstnanci jednotlivých kanceláří na projekty daného zákazníka.

In [55]:
statistika = zamestnanci_s_vykazy.groupby('mesto')['pocet_hodin'].sum()
print('Statistiky projektů na jednotlivé kanceláře:')
statistika

Statistiky projektů na jednotlivé kanceláře:

mesto
Liberec    28.0
Plzeň      15.6
Praha      57.5
Name: pocet_hodin, dtype: float64